k6/result/movie-test-noCondV1.txt


         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/

     execution: local
        script: k6/movie-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 50 looping VUs for 30s (gracefulStop: 30s)


     ✓ v1 no-condition is 200

     checks.........................: 100.00% 700 out of 700
     data_received..................: 593 MB  19 MB/s
     data_sent......................: 78 kB   2.5 kB/s
     http_req_blocked...............: avg=243.31µs min=1µs     med=6µs      max=6.59ms   p(90)=17.1µs   p(95)=1.79ms
     http_req_connecting............: avg=110.52µs min=0s      med=0s       max=3.29ms   p(90)=0s       p(95)=841.64µs
     http_req_duration..............: avg=214.35ms min=75.42ms med=161.33ms max=1.17s    p(90)=343.06ms p(95)=543.45ms
       { expected_response:true }...: avg=214.35ms min=75.42ms med=161.33ms max=1.17s    p(90)=343.06ms p(95)=543.45ms
     http_req_failed................: 0.00%   0 out of 700
     http_req_receiving.............: avg=21.1ms   min=3.81ms  med=12.58ms  max=146.14ms p(90)=43.78ms  p(95)=75.63ms
     http_req_sending...............: avg=79.54µs  min=2µs     med=16µs     max=3.75ms   p(90)=55.1µs   p(95)=464.29µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s
     http_req_waiting...............: avg=193.16ms min=66.46ms med=144.1ms  max=1.16s    p(90)=298.53ms p(95)=530.7ms
     http_reqs......................: 700     22.195843/s
     iteration_duration.............: avg=2.21s    min=2.07s   med=2.16s    max=3.18s    p(90)=2.34s    p(95)=2.54s
     iterations.....................: 700     22.195843/s
     vus............................: 28      min=28         max=50
     vus_max........................: 50      min=50         max=50


running (0m31.5s), 00/50 VUs, 700 complete and 0 interrupted iterations
default ✓ [======================================] 50 VUs  30s