k6/result/test_fixed_query.txt
 % k6 run k6/test_fixed_query.js


         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/

     execution: local
        script: k6/test_fixed_query.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 50 looping VUs for 30s (gracefulStop: 30s)


     ✓ status is 200
     ✓ response is not empty

     checks.........................: 100.00% 31114 out of 31114
     data_received..................: 11 MB   370 kB/s
     data_sent......................: 2.8 MB  95 kB/s
     http_req_blocked...............: avg=24.79µs min=0s     med=3µs     max=6.54ms   p(90)=5µs      p(95)=6µs
     http_req_connecting............: avg=5.23µs  min=0s     med=0s      max=1.08ms   p(90)=0s       p(95)=0s
     http_req_duration..............: avg=96.44ms min=9.77ms med=87.95ms max=923.17ms p(90)=138.7ms  p(95)=163.84ms
       { expected_response:true }...: avg=96.44ms min=9.77ms med=87.95ms max=923.17ms p(90)=138.7ms  p(95)=163.84ms
     http_req_failed................: 0.00%   0 out of 15557
     http_req_receiving.............: avg=93.6µs  min=5µs    med=66µs    max=3.25ms   p(90)=187.4µs  p(95)=251µs
     http_req_sending...............: avg=12.43µs min=2µs    med=8µs     max=4.31ms   p(90)=19µs     p(95)=31µs
     http_req_tls_handshaking.......: avg=0s      min=0s     med=0s      max=0s       p(90)=0s       p(95)=0s
     http_req_waiting...............: avg=96.33ms min=9.74ms med=87.84ms max=923.12ms p(90)=138.56ms p(95)=163.7ms
     http_reqs......................: 15557   516.951022/s
     iteration_duration.............: avg=96.58ms min=9.83ms med=88.07ms max=928.87ms p(90)=138.81ms p(95)=164ms
     iterations.....................: 15557   516.951022/s
     vus............................: 50      min=50             max=50
     vus_max........................: 50      min=50             max=50


running (0m30.1s), 00/50 VUs, 15557 complete and 0 interrupted iterations
default ✓ [======================================] 50 VUs  30s